src/Misc/Usability/Usability Overview.org
#+SETUPFILE: ~/.emacs.d/src/org-templates/level-2.org
#+TITLE: 
#+OPTIONS: num:nil H:2


* General

* Blogs
** Jakob Nielsen's Web site, useit.com
www.useit.com

Beginning with Usability Engineering in 1984, Jakob Nielsen has long
been usability's most articulate and thought-provoking advocate. 

Also check out his Neilsen Norman Group
reports(http://www.nngroup.com/reports/). 


* Books(Web Usability)
** Steve Krug
+ Don't Make Me Think(A Common Sense Approach to Web Usability)
+ Rocket Surgery Made Easy : The Do-It-Yourself Guide to Finding and Fixing Usability Problems

** Information Architecture for the World Wide Web: Designing Large-Scale Web Site
Peter Morville (Author), Louis Rosenfeld (Author)

** Why We Buy: The Science of Shopping--Updated and Revised for the Internet, the Global Consumer, and Beyond
Paco Underhill (Author)

** Sources of Power: How People Make Decisions
Gary Klein (Author)

** The Practice of Creativity: A Manual for Dynamic Group Problem-Solving
George M. Prince (Author), Steve Krug (Foreword)

** Homepage Usability: 50 Websites Deconstructed
Jakob Nielsen (Author), Marie Tahir (Author)

** Web Application Design Handbook: Best Practices for Web-Based Software 
Susan Fowler (Author), Victor Stanwick (Author)
** Defensive Design for the Web: How to improve error messages, help, forms, and other crisis points
Matthew Linderman (Author), Jason Fried (Author)

* Books
** The Design of Everyday Things
Donald A. Norman (Author)

** Emotional Design: Why We Love (or Hate) Everyday Things
Donald A. Norman (Author)
