public_html/Misc/Usability/Usability Overview.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title></title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content=""/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-09-08 15:56:04 HKT"/>
<meta name="author" content="Shi Shougang"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="./assets/stylesheet.css" type="text/css"/>
<link rel="stylesheet" type="text/css" href="../../assets/stylesheet.css" />

</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="../../index.html"> UP </a>
 |
 <a accesskey="H" href="../../index.html"> HOME </a>
</div>

<div id="preamble">

</div>

<div id="content">
<h1 class="title"></h1>



<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">General</a></li>
<li><a href="#sec-2">Blogs</a>
<ul>
<li><a href="#sec-2-1">Jakob Nielsen's Web site, useit.com</a></li>
</ul>
</li>
<li><a href="#sec-3">Books(Web Usability)</a>
<ul>
<li><a href="#sec-3-1">Steve Krug</a></li>
<li><a href="#sec-3-2">Information Architecture for the World Wide Web: Designing Large-Scale Web Site</a></li>
<li><a href="#sec-3-3">Why We Buy: The Science of Shopping&ndash;Updated and Revised for the Internet, the Global Consumer, and Beyond</a></li>
<li><a href="#sec-3-4">Sources of Power: How People Make Decisions</a></li>
<li><a href="#sec-3-5">The Practice of Creativity: A Manual for Dynamic Group Problem-Solving</a></li>
<li><a href="#sec-3-6">Homepage Usability: 50 Websites Deconstructed</a></li>
<li><a href="#sec-3-7">Web Application Design Handbook: Best Practices for Web-Based Software</a></li>
<li><a href="#sec-3-8">Defensive Design for the Web: How to improve error messages, help, forms, and other crisis points</a></li>
</ul>
</li>
<li><a href="#sec-4">Books</a>
<ul>
<li><a href="#sec-4-1">The Design of Everyday Things</a></li>
<li><a href="#sec-4-2">Emotional Design: Why We Love (or Hate) Everyday Things</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">General</h2>
<div class="outline-text-2" id="text-1">


</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Blogs</h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1">Jakob Nielsen's Web site, useit.com</h3>
<div class="outline-text-3" id="text-2-1">

<p>www.useit.com
</p>
<p>
Beginning with Usability Engineering in 1984, Jakob Nielsen has long
been usability's most articulate and thought-provoking advocate. 
</p>
<p>
Also check out his Neilsen Norman Group
reports(<a href="http://www.nngroup.com/reports/">http://www.nngroup.com/reports/</a>). 
</p>

</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">Books(Web Usability)</h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1">Steve Krug</h3>
<div class="outline-text-3" id="text-3-1">

<ul>
<li>Don't Make Me Think(A Common Sense Approach to Web Usability)
</li>
<li>Rocket Surgery Made Easy : The Do-It-Yourself Guide to Finding and Fixing Usability Problems
</li>
</ul>


</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2">Information Architecture for the World Wide Web: Designing Large-Scale Web Site</h3>
<div class="outline-text-3" id="text-3-2">

<p>Peter Morville (Author), Louis Rosenfeld (Author)
</p>
</div>

</div>

<div id="outline-container-3-3" class="outline-3">
<h3 id="sec-3-3">Why We Buy: The Science of Shopping&ndash;Updated and Revised for the Internet, the Global Consumer, and Beyond</h3>
<div class="outline-text-3" id="text-3-3">

<p>Paco Underhill (Author)
</p>
</div>

</div>

<div id="outline-container-3-4" class="outline-3">
<h3 id="sec-3-4">Sources of Power: How People Make Decisions</h3>
<div class="outline-text-3" id="text-3-4">

<p>Gary Klein (Author)
</p>
</div>

</div>

<div id="outline-container-3-5" class="outline-3">
<h3 id="sec-3-5">The Practice of Creativity: A Manual for Dynamic Group Problem-Solving</h3>
<div class="outline-text-3" id="text-3-5">

<p>George M. Prince (Author), Steve Krug (Foreword)
</p>
</div>

</div>

<div id="outline-container-3-6" class="outline-3">
<h3 id="sec-3-6">Homepage Usability: 50 Websites Deconstructed</h3>
<div class="outline-text-3" id="text-3-6">

<p>Jakob Nielsen (Author), Marie Tahir (Author)
</p>
</div>

</div>

<div id="outline-container-3-7" class="outline-3">
<h3 id="sec-3-7">Web Application Design Handbook: Best Practices for Web-Based Software</h3>
<div class="outline-text-3" id="text-3-7">

<p>Susan Fowler (Author), Victor Stanwick (Author)
</p></div>

</div>

<div id="outline-container-3-8" class="outline-3">
<h3 id="sec-3-8">Defensive Design for the Web: How to improve error messages, help, forms, and other crisis points</h3>
<div class="outline-text-3" id="text-3-8">

<p>Matthew Linderman (Author), Jason Fried (Author)
</p>
</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">Books</h2>
<div class="outline-text-2" id="text-4">


</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1">The Design of Everyday Things</h3>
<div class="outline-text-3" id="text-4-1">

<p>Donald A. Norman (Author)
</p>
</div>

</div>

<div id="outline-container-4-2" class="outline-3">
<h3 id="sec-4-2">Emotional Design: Why We Love (or Hate) Everyday Things</h3>
<div class="outline-text-3" id="text-4-2">

<p>Donald A. Norman (Author)
</p></div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-09-08 15:56:04 HKT</p>
<p class="author">Author: Shi Shougang</p>
<p class="creator">Org version 7.8.09 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
